{
  "version": "1.0",
  "last_updated": "2026-01-07",
  "person": {
    "name": "Shay O'Reilly",
    "linkedin": "https://www.linkedin.com/in/shayoreilly/",
    "github": "https://github.com/shay-o"
  },
  "roles": [
    {
      "id": "adobe-analytics-pm",
      "title": "Principal Product Manager",
      "organization": "Adobe Analytics",
      "start_date": "2020-09",
      "end_date": "2025-09",
      "summary": "Led product roadmap for data gathering tools within Adobe Analytics and Customer Journey Analytics, focusing on data collection, customer migration, and cross-product infrastructure."
    },
    {
      "id": "adobe-adcloud-pm",
      "title": "Product Manager",
      "organization": "Adobe Ad Cloud",
      "start_date": "2017-12",
      "end_date": "2020-09",
      "summary": "Managed analytics and reporting products for Adobe Ad Cloud, including attribution, integrations with Adobe Analytics, and third-party measurement platforms."
    },
    {
      "id": "cardlytics-director",
      "title": "Director of Analytics",
      "organization": "Cardlytics",
      "start_date": null,
      "end_date": null,
      "summary": "Led analytics team, managed data scientists, and established reporting practices to measure advertising product effectiveness."
    }
  ],
  "achievements": [
    {
      "id": "edge-enrichment-2021-2023",
      "role_id": "adobe-analytics-pm",
      "title": "Edge Enrichment at Massive Scale",
      "timeframe": "2021 - 2023",
      "context": "Adobe was modernizing its data collection infrastructure through Experience Edge. Multiple Adobe products (CJA, Adobe Analytics, AEP) needed enrichment services for incoming data, but each team was building their own solutions, leading to duplicated effort and inconsistent results.",
      "problem": "We needed centralized, high-performance enrichment services (geo lookup, bot detection, device lookup) that could handle tens of billions of requests per day with single-digit millisecond latency while maintaining SLAs for downstream systems. The challenge was building shared infrastructure that would work across multiple Adobe products with different requirements.",
      "actions": [
        "Led the initiative to design and build three enrichment services on Adobe Experience Edge",
        "Evaluated third-party vendors to determine the best functionality and cost trade-offs",
        "Drove cross-functional alignment across multiple Adobe businesses (CJA, AA, AEP) and technical teams",
        "Defined feature set and SLA requirements that balanced competing priorities",
        "Navigated complex shared infrastructure discussions, persuading teams to adopt approaches that would impact their users"
      ],
      "impact": {
        "quantitative": [
          "Achieved single-digit millisecond latency",
          "Handled tens of billions of lookups per day"
        ],
        "qualitative": [
          "Multiple Adobe businesses successfully consuming the service",
          "Eliminated duplicated vendor relationships",
          "Reduced overall costs",
          "Improved data consistency across products"
        ]
      },
      "competencies": [
        "Cross-functional leadership",
        "Vendor evaluation",
        "Infrastructure architecture",
        "Stakeholder management",
        "Technical product management",
        "Negotiation and persuasion"
      ],
      "story": "This project taught me how to balance the needs of multiple stakeholders with different priorities. The key was focusing on shared infrastructure benefits while being transparent about trade-offs. I learned that sometimes slowing down to build consensus upfront leads to faster execution later.",
      "tags": [
        "infrastructure",
        "cross-functional",
        "technical",
        "scale",
        "vendor-management",
        "Adobe-Analytics",
        "CJA",
        "AEP"
      ],
      "evidence_links": [],
      "reflection": "This project taught me how to balance the needs of multiple stakeholders with different priorities. The key was focusing on shared infrastructure benefits while being transparent about trade-offs. I learned that sometimes slowing down to build consensus upfront leads to faster execution later."
    },
    {
      "id": "cookieless-privacy-2020-2025",
      "role_id": "adobe-analytics-pm",
      "title": "Privacy & Cookieless Tracking Thought Leadership",
      "timeframe": "Sept 2020 - Sept 2025",
      "context": "Privacy limitations and regulations were proliferating impacting the ability of our customers to collect usage data and thus their ability to use Adobe Analytics reporting to make business decisions. There were a variety of changes with plenty of nuances.",
      "problem": "Customers were concerned about their ability to collect data and how this would impact their ability to use Analytics reporting on site/app usage to make business decisions. There was plenty of complexity which lead to confusion and concern. This in turn threatened to undermine the value of Adobe's solutions.",
      "actions": [
        "Established myself as the go-to expert on privacy and cookieless tracking, creating resources that empowered customers to assess and adapt to changes",
        "Created comprehensive documentation and customer presentations that clarified complex privacy changes and their implications",
        "Designed a pre-built reporting template that leveraged Adobe Analytics' own capabilities to measure the specific impact on each customer's data, showing identity reset patterns and visitor behavior changes",
        "Built enablement materials for sales and customer-facing teams, including training sessions and knowledge transfer",
        "The reporting template used Analytics' strengths to show how often visitors returned later than 7 days, which under Safari's ITP limitations would reset user identity and cause them to be treated as new users with no history"
      ],
      "impact": {
        "quantitative": [
          "2 live presentations at Adobe Summit to a total audience of about 1000",
          "Collateral created for sales and other customer facing teams along with training and knowledge transfer",
          "Contributed directly to public documentation"
        ],
        "qualitative": [
          "Highlighted the power of existing product, provided clarity of the impact which end users could share with their stakeholders",
          "Usually the impact was less than customers had feared",
          "Showed how customers could use reporting to adjust for the impacts of these changes to the data"
        ]
      },
      "competencies": [
        "Technical communication",
        "Thought leadership",
        "Customer education",
        "Complex problem simplification",
        "Self-directed learning",
        "Product expertise",
        "Enablement at scale",
        "Documentation",
        "Public speaking",
        "Sales enablement",
        "Customer advisory",
        "Creating actionable tools"
      ],
      "story": "This experience taught me that customers are hungry for guidance in navigating challenges in their space. Acting as a trusted advisor and partner is essential in B2B relationships. I learned that combining education with practical, actionable tools (like the reporting template) has more impact than documentation alone. The work demonstrated the value of becoming a subject matter expert and using that expertise to enable customers and internal teams at scale.",
      "tags": [
        "Privacy",
        "Cookieless",
        "Thought Leadership",
        "customer-education",
        "documentation",
        "public-speaking",
        "summit-presentation",
        "technical-communication",
        "enablement",
        "Safari-ITP",
        "customer-advisory",
        "self-directed-learning",
        "Adobe-Analytics",
        "sales-enablement",
        "product-expertise"
      ],
      "evidence_links": [
        "https://experienceleague.adobe.com/en/docs/analytics/technotes/cookies/cookies#measure-itp-effect",
        "https://experienceleague.adobe.com/en/docs/analytics/technotes/cookies/cookieless",
        "https://medium.com/@ericmatisoff/assessing-itps-effect-on-adobe-analytics-data-469788e9733d"
      ],
      "reflection": "This experience taught me that customers are hungry for guidance in navigating challenges in their space. Acting as a trusted advisor and partner is essential in B2B relationships. I learned that combining education with practical, actionable tools (like the reporting template) has more impact than documentation alone. The work demonstrated the value of becoming a subject matter expert and using that expertise to enable customers and internal teams at scale."
    },
    {
      "id": "cja-migration-strategy-2020-2025",
      "role_id": "adobe-analytics-pm",
      "title": "CJA Migration Strategy",
      "timeframe": "2020 - 2025",
      "context": "Adobe was transitioning customers from legacy Adobe Analytics to the modern Customer Journey Analytics (CJA) platform. This required careful planning to balance speed of migration with quality of implementation.",
      "problem": "How to migrate customers from Adobe Analytics to CJA efficiently while balancing quick-and-dirty approaches against slow-and-clean implementations. Needed to navigate complex shared infrastructure and persuade platform teams to adopt approaches that would impact other users.",
      "actions": [
        "Led strategic planning for customer migration from Adobe Analytics to Customer Journey Analytics",
        "Balanced trade-offs between quick-and-dirty vs. slow-and-clean migration approaches",
        "Navigated complex shared infrastructure requirements, persuading platform teams to adopt approaches that would impact other users",
        "Developed multiple time-to-value (TTV) projects to accelerate customer adoption",
        "Explored AI-driven solutions for migration assistance, including understanding customer jobs-to-be-done and pain points"
      ],
      "impact": {
        "quantitative": [],
        "qualitative": [
          "Established strategic framework for customer migration",
          "Accelerated time-to-value for customer adoption",
          "Successfully navigated complex cross-team dependencies"
        ]
      },
      "competencies": [
        "Strategic planning",
        "Migration strategy",
        "Stakeholder management",
        "AI exploration",
        "Customer research",
        "Cross-functional leadership"
      ],
      "story": "",
      "tags": [
        "migration",
        "strategy",
        "CJA",
        "Adobe-Analytics",
        "cross-functional",
        "AI"
      ],
      "evidence_links": [
        "https://summitlab2025.com/workbook.pdf"
      ],
      "reflection": ""
    },
    {
      "id": "omnivore-2020-2025",
      "role_id": "adobe-analytics-pm",
      "title": "Omnivore: Streamlined CJA Setup",
      "timeframe": "2020 - 2025",
      "context": "Setting up Customer Journey Analytics required deep technical expertise and significant time investment, creating a barrier to adoption for many customers.",
      "problem": "Customers needed to map business rules to XDM schema to use CJA, but this required significant technical expertise and time. This barrier to entry was slowing adoption and creating friction in the customer journey.",
      "actions": [
        "Led initiative to map business rules to XDM schema, dramatically reducing time-to-value for CJA adoption",
        "Lowered technical expertise and time required for customers to get set up on CJA",
        "Applied solution across four distinct use cases: new AEM customers, new CJA customers, existing CJA customers, and Content Analytics",
        "Developed streamlined onboarding workflows for ACA and AEM customers"
      ],
      "impact": {
        "quantitative": [
          "Applied across four distinct customer use cases"
        ],
        "qualitative": [
          "Dramatically reduced time-to-value for CJA adoption",
          "Lowered technical expertise barrier",
          "Streamlined onboarding for multiple customer segments"
        ]
      },
      "competencies": [
        "Product strategy",
        "Technical product management",
        "Schema mapping",
        "Customer onboarding",
        "Time-to-value optimization"
      ],
      "story": "",
      "tags": [
        "CJA",
        "onboarding",
        "XDM",
        "time-to-value",
        "Adobe-Analytics",
        "AEM",
        "technical"
      ],
      "evidence_links": [],
      "reflection": ""
    },
    {
      "id": "content-analytics-condor-2020-2025",
      "role_id": "adobe-analytics-pm",
      "title": "Content Analytics (Condor)",
      "timeframe": "2020 - 2025",
      "context": "Content creators needed better analytics capabilities to understand content performance, but existing solutions were complex and difficult to implement.",
      "problem": "How to create a streamlined content analytics solution that bridges executive vision, high-level business goals, and complex customer requirements while collaborating across multiple Adobe teams.",
      "actions": [
        "Guided project from early vision through execution",
        "Created streamlined setup process for content analytics implementation",
        "Bridged executive vision, high-level business goals, and complex customer requirements",
        "Collaborated across AEM and Intelligence Services teams"
      ],
      "impact": {
        "quantitative": [],
        "qualitative": [
          "Delivered streamlined content analytics solution",
          "Successfully bridged executive vision with customer needs",
          "Enabled cross-team collaboration between AEM and Intelligence Services"
        ]
      },
      "competencies": [
        "Product vision",
        "Cross-functional leadership",
        "AI integration",
        "Stakeholder management",
        "Executive communication"
      ],
      "story": "",
      "tags": [
        "content-analytics",
        "AI",
        "AEM",
        "Intelligence-Services",
        "cross-functional",
        "Adobe-Analytics"
      ],
      "evidence_links": [
        "https://engage.adobe.com/ExpLeagueLive-250522.html?sdid=NGWGR6CF&mv=other"
      ],
      "reflection": ""
    },
    {
      "id": "xdm-translator-2020-2025",
      "role_id": "adobe-analytics-pm",
      "title": "XDM Translator",
      "timeframe": "2020 - 2025",
      "context": "Customers migrating from Adobe Analytics to CJA needed to translate their legacy schema to the new XDM standard, a complex and error-prone process.",
      "problem": "Legacy Adobe Analytics schema needed to be mapped to new XDM standard to enable customer transitions to CJA.",
      "actions": [
        "Developed mapping solution from legacy Adobe Analytics schema to new XDM standard",
        "Enabled smoother customer transitions to CJA"
      ],
      "impact": {
        "quantitative": [],
        "qualitative": [
          "Enabled smoother customer transitions",
          "Reduced complexity of schema migration"
        ]
      },
      "competencies": [
        "Technical product management",
        "Schema mapping",
        "Migration strategy"
      ],
      "story": "",
      "tags": [
        "XDM",
        "migration",
        "schema",
        "CJA",
        "Adobe-Analytics",
        "technical"
      ],
      "evidence_links": [],
      "reflection": ""
    },
    {
      "id": "pageview-inflation-2020-2025",
      "role_id": "adobe-analytics-pm",
      "title": "Pageview Inflation Resolution",
      "timeframe": "2020 - 2025",
      "context": "New Edge infrastructure introduced a difficult regression where data classification inconsistencies were impacting reporting accuracy and customer costs.",
      "problem": "Data classification inconsistencies introduced by new Edge infrastructure were impacting both reporting accuracy and costs for customers.",
      "actions": [
        "Tackled difficult regression introduced by new Edge infrastructure",
        "Collaborated with technical experts and stakeholders to understand complex technical issues",
        "Developed and implemented solution"
      ],
      "impact": {
        "quantitative": [],
        "qualitative": [
          "Resolved data classification inconsistencies",
          "Restored reporting accuracy",
          "Prevented ongoing cost impacts for customers"
        ]
      },
      "competencies": [
        "Technical troubleshooting",
        "Cross-functional collaboration",
        "Problem solving",
        "Stakeholder management"
      ],
      "story": "",
      "tags": [
        "troubleshooting",
        "Edge",
        "technical",
        "data-quality",
        "Adobe-Analytics"
      ],
      "evidence_links": [],
      "reflection": ""
    },
    {
      "id": "client-hints-2020-2025",
      "role_id": "adobe-analytics-pm",
      "title": "Client Hints Adaptation",
      "timeframe": "2020 - 2025",
      "context": "Browsers were transitioning from user agent strings to client hints for device detection, requiring updates to Adobe's data collection infrastructure.",
      "problem": "Adapt Adobe Analytics to use new browser client hints technology for device detection as browsers deprecated traditional user agent strings.",
      "actions": [
        "Managed adaptation to new browser client hints technology for device detection"
      ],
      "impact": {
        "quantitative": [],
        "qualitative": [
          "Maintained device detection capabilities as browser technology evolved"
        ]
      },
      "competencies": [
        "Technical product management",
        "Browser technology",
        "Data collection"
      ],
      "story": "",
      "tags": [
        "client-hints",
        "device-detection",
        "browser-technology",
        "Adobe-Analytics",
        "technical"
      ],
      "evidence_links": [],
      "reflection": ""
    },
    {
      "id": "consent-navigator-2020-2025",
      "role_id": "adobe-analytics-pm",
      "title": "Consent Navigator",
      "timeframe": "2020 - 2025",
      "context": "Privacy regulations required solutions for anonymous and minimal data collection scenarios, but customers needed to understand the business value before investing.",
      "problem": "Develop solution for anonymous and minimal data collection while validating customer willingness to pay and understanding feature importance across different segments.",
      "actions": [
        "Led project for anonymous and minimal data collection scenarios",
        "Conducted third-party surveys to determine customer willingness to pay",
        "Assessed feature importance across different customer segments (geography, vertical, company size)"
      ],
      "impact": {
        "quantitative": [],
        "qualitative": [
          "Validated customer demand across segments",
          "Informed product roadmap with willingness-to-pay data"
        ]
      },
      "competencies": [
        "Market research",
        "Customer research",
        "Survey design",
        "Product strategy",
        "Privacy compliance"
      ],
      "story": "",
      "tags": [
        "privacy",
        "consent",
        "market-research",
        "Adobe-Analytics",
        "customer-research"
      ],
      "evidence_links": [],
      "reflection": ""
    },
    {
      "id": "ipv6-evaluation-2020-2025",
      "role_id": "adobe-analytics-pm",
      "title": "IPv6 Strategic Evaluation",
      "timeframe": "2020 - 2025",
      "context": "Some customers were affected by lack of IPv6 support, but the business impact and priority needed careful evaluation.",
      "problem": "Assess priority of IPv6 support given limited resources and competing priorities.",
      "actions": [
        "Assessed and made strategic decision not to prioritize IPv6 support",
        "Determined that affected customers had viable workarounds",
        "Validated that issue would not drive customer churn despite being technically important"
      ],
      "impact": {
        "quantitative": [],
        "qualitative": [
          "Made informed strategic decision on resource allocation",
          "Validated customer impact and churn risk"
        ]
      },
      "competencies": [
        "Strategic decision making",
        "Risk assessment",
        "Customer research",
        "Prioritization"
      ],
      "story": "",
      "tags": [
        "strategy",
        "prioritization",
        "IPv6",
        "Adobe-Analytics",
        "risk-assessment"
      ],
      "evidence_links": [],
      "reflection": ""
    },
    {
      "id": "aa4adc-2017-2020",
      "role_id": "adobe-adcloud-pm",
      "title": "Analytics for Ad Cloud (AA4AdC)",
      "timeframe": "2017 - 2020",
      "context": "Adobe Ad Cloud customers needed deep integration with Adobe Analytics to understand the full customer journey from ad exposure to conversion.",
      "problem": "Create seamless integration between Adobe Ad Cloud and Adobe Analytics to provide customers with comprehensive attribution and journey insights.",
      "actions": [
        "Managed integration between Adobe Ad Cloud and Adobe Analytics",
        "Became team expert in attribution reporting system",
        "Supported extensive troubleshooting and customer-reactive work",
        "Established deep expertise in Ad Cloud's attribution system, becoming the go-to resource for complex attribution questions"
      ],
      "impact": {
        "quantitative": [],
        "qualitative": [
          "Became team expert in attribution reporting",
          "Enabled comprehensive customer journey analysis",
          "Provided critical customer support for complex attribution scenarios"
        ]
      },
      "competencies": [
        "Product integration",
        "Attribution modeling",
        "Technical expertise",
        "Customer support",
        "Troubleshooting"
      ],
      "story": "",
      "tags": [
        "attribution",
        "integration",
        "Ad-Cloud",
        "Adobe-Analytics",
        "technical"
      ],
      "evidence_links": [],
      "reflection": ""
    },
    {
      "id": "frequency-reporting-2017-2020",
      "role_id": "adobe-adcloud-pm",
      "title": "Frequency Reporting Overhaul",
      "timeframe": "2017 - 2020",
      "context": "Ad Cloud's frequency reporting was broken and very limited, preventing customers from understanding ad exposure patterns.",
      "problem": "Frequency reporting system was broken and limited. Needed to determine customer data needs, define use cases, and communicate that data was estimated.",
      "actions": [
        "Completely rebuilt broken and limited frequency reporting system",
        "Determined customer data needs (summary vs. distribution of frequencies)",
        "Defined use cases and appropriate data granularity",
        "Developed clear communication strategy for estimated data",
        "Delivered significantly more detailed and accurate reporting"
      ],
      "impact": {
        "quantitative": [],
        "qualitative": [
          "Delivered significantly more detailed and accurate reporting",
          "Enabled customers to understand ad exposure patterns",
          "Established clear communication about data estimation"
        ]
      },
      "competencies": [
        "Product rebuilding",
        "Customer research",
        "Data strategy",
        "Communication strategy",
        "Reporting"
      ],
      "story": "",
      "tags": [
        "reporting",
        "frequency",
        "Ad-Cloud",
        "customer-research",
        "data-quality"
      ],
      "evidence_links": [],
      "reflection": ""
    },
    {
      "id": "mmp-integration-2017-2020",
      "role_id": "adobe-adcloud-pm",
      "title": "Mobile Measurement Partner Integration",
      "timeframe": "2017 - 2020",
      "context": "Mobile advertising required integration with third-party Mobile Measurement Partners (MMPs) to provide comprehensive measurement across platforms.",
      "problem": "Enable bidirectional data flow between Ad Cloud and Mobile Measurement Partners to provide customers with comprehensive mobile advertising measurement.",
      "actions": [
        "Developed integrations with third-party Mobile Measurement Partners",
        "Enabled bidirectional data flow: ad impressions from Ad Cloud to MMPs, conversions from MMPs back to Adobe",
        "Supported complex data synchronization requirements"
      ],
      "impact": {
        "quantitative": [],
        "qualitative": [
          "Enabled comprehensive mobile advertising measurement",
          "Successfully integrated with multiple MMP partners",
          "Provided customers with unified view across platforms"
        ]
      },
      "competencies": [
        "Partnership management",
        "Integration",
        "Data synchronization",
        "Mobile advertising"
      ],
      "story": "",
      "tags": [
        "integration",
        "mobile",
        "MMP",
        "Ad-Cloud",
        "partnerships"
      ],
      "evidence_links": [],
      "reflection": ""
    }
  ]
}
